askn37/multix-zinnia-sdk-megaAVR/boards.txt
menu.01_variant=Variant
menu.02_clock=Clock
menu.11_BODMODE=BOD Mode
menu.12_BODLVL=BOD Level
menu.21_resetpin=FUSE PF6
menu.22_updipin=FUSE UPDI
menu.24_eeprom=EEPROM
menu.26_userrow=USERROW
menu.27_fusefile=FUSE define
menu.51_buildopt=Build Option
menu.52_macroapi=Build API
menu.53_printf=Build "printf"
menu.54_console_select=UART and LED
menu.90_console_baud=Console
menu.95_bootloader=Bootloader


megaAVR0.name=megaAVR-0 with Bootloader
megaAVR0.build.board=AVR_ATMEGA4809
megaAVR0.build.core=megaAVR
tinyAVR012.name=tinyAVR-0/1/2 with Bootloader
tinyAVR012.build.board=AVR_ATTINY1627
tinyAVR012.build.core=megaAVR
separator1.name=-
separator1.build.board=-
tinyAVR01.name=tinyAVR-0/1 8pin with Bootloader
tinyAVR01.build.board=AVR_ATTINY412
tinyAVR01.build.core=megaAVR
separator2.name=-
separator2.build.board=-
megaAVR0_noloader.name=megaAVR-0 w/o Bootloader
megaAVR0_noloader.build.board=AVR_ATMEGA4809
megaAVR0_noloader.build.core=megaAVR
tinyAVR012_noloader.name=tinyAVR-0/1/2 w/o Bootloader
tinyAVR012_noloader.build.board=AVR_ATTINY1617
tinyAVR012_noloader.build.core=megaAVR


megaAVR0.programmer.default=pickit4_updi
tinyAVR012.programmer.default=pickit4_updi
tinyAVR01.programmer.default=pickit4_updi
megaAVR0_noloader.programmer.default=pkobn_updi
tinyAVR012_noloader.programmer.default=pkobn_updi


megaAVR0.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
megaAVR0.bootloader.BOOTSIZE=0x02
megaAVR0.bootloader.CODESIZE=0x00
megaAVR0.bootloader.OSCCFG=0x7E
megaAVR0.bootloader.SYSCFG0=0b1101{bootloader.reset_bit}1{bootloader.eesave_bit}
megaAVR0.bootloader.SYSCFG1=0xFF
megaAVR0.bootloader.WDTCFG=0x00
megaAVR0.bootloader.bod_lvl=000
megaAVR0.bootloader.bod_mode=00
megaAVR0.bootloader.bod_sample=0
megaAVR0.bootloader.eepupload=
megaAVR0.bootloader.urowupload=
megaAVR0.bootloader.fuseupload={bootloader.fuses}
megaAVR0.bootloader.eesave_bit=1
megaAVR0.bootloader.reset_bit=11
megaAVR0.bootloader.tool=avrdude
megaAVR0.bootloader.programed_type=.with_bootloader
megaAVR0.build.export_merged_output=true
megaAVR0.build.text_section_start=.text=0x200
megaAVR0.build.buildopt=-DNDEBUG
megaAVR0.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0.build.macroapi=-DENABLE_MACRO_API
megaAVR0.build.printf=
megaAVR0.build.printflt=
megaAVR0.build.linker_script=avrxmega3_p128.x
megaAVR0.upload.protocol=arduino
megaAVR0.upload.speed=115200
megaAVR0.upload.tool=avrdude

megaAVR0.menu.01_variant.ATmega4809_48P=48pin ATmega4809 (48KiB+6KiB)
megaAVR0.menu.01_variant.ATmega4809_48P.build.board=AVR_ATMEGA4809
megaAVR0.menu.01_variant.ATmega4809_48P.build.mcu=atmega4809
megaAVR0.menu.01_variant.ATmega4809_48P.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.ATmega4809_48P.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.ATmega4809_48P.upload.maximum_size=48640

megaAVR0.menu.01_variant.ATmega3209_48P=48pin ATmega3209 (32KiB+4KiB)
megaAVR0.menu.01_variant.ATmega3209_48P.build.board=AVR_ATMEGA3209
megaAVR0.menu.01_variant.ATmega3209_48P.build.mcu=atmega3209
megaAVR0.menu.01_variant.ATmega3209_48P.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.ATmega3209_48P.upload.maximum_data_size=4096
megaAVR0.menu.01_variant.ATmega3209_48P.upload.maximum_size=32256

megaAVR0.menu.01_variant.ATmega1609_48P=48pin ATmega1609 (16KiB+2KiB)
megaAVR0.menu.01_variant.ATmega1609_48P.build.board=AVR_ATMEGA1609
megaAVR0.menu.01_variant.ATmega1609_48P.build.mcu=atmega1609
megaAVR0.menu.01_variant.ATmega1609_48P.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.ATmega1609_48P.upload.maximum_data_size=2048
megaAVR0.menu.01_variant.ATmega1609_48P.upload.maximum_size=15872

megaAVR0.menu.01_variant.ATmega809_48P=48pin ATmega809 (8KiB+1KiB)
megaAVR0.menu.01_variant.ATmega809_48P.build.board=AVR_ATMEGA809
megaAVR0.menu.01_variant.ATmega809_48P.build.mcu=atmega809
megaAVR0.menu.01_variant.ATmega809_48P.build.variant=megaAVR0_48
megaAVR0.menu.01_variant.ATmega809_48P.upload.maximum_data_size=1024
megaAVR0.menu.01_variant.ATmega809_48P.upload.maximum_size=7680

megaAVR0.menu.01_variant.separator1=-

megaAVR0.menu.01_variant.ATmega4809_40P=40pin ATmega4809 (48KiB+6KiB)
megaAVR0.menu.01_variant.ATmega4809_40P.build.board=AVR_ATMEGA4809
megaAVR0.menu.01_variant.ATmega4809_40P.build.mcu=atmega4809
megaAVR0.menu.01_variant.ATmega4809_40P.build.variant=megaAVR0_40
megaAVR0.menu.01_variant.ATmega4809_40P.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.ATmega4809_40P.upload.maximum_size=48640

megaAVR0.menu.01_variant.separator2=-

megaAVR0.menu.01_variant.ATmega4808_32P=32pin ATmega4808 (48KiB+6KiB)
megaAVR0.menu.01_variant.ATmega4808_32P.build.board=AVR_ATMEGA4808
megaAVR0.menu.01_variant.ATmega4808_32P.build.mcu=atmega4808
megaAVR0.menu.01_variant.ATmega4808_32P.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.ATmega4808_32P.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.ATmega4808_32P.upload.maximum_size=48640

megaAVR0.menu.01_variant.ATmega3208_32P=32pin ATmega3208 (32KiB+4KiB)
megaAVR0.menu.01_variant.ATmega3208_32P.build.board=AVR_ATMEGA3208
megaAVR0.menu.01_variant.ATmega3208_32P.build.mcu=atmega3208
megaAVR0.menu.01_variant.ATmega3208_32P.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.ATmega3208_32P.upload.maximum_data_size=4096
megaAVR0.menu.01_variant.ATmega3208_32P.upload.maximum_size=32256

megaAVR0.menu.01_variant.ATmega1608_32P=32pin ATmega1608 (16KiB+2KiB)
megaAVR0.menu.01_variant.ATmega1608_32P.build.board=AVR_ATMEGA1608
megaAVR0.menu.01_variant.ATmega1608_32P.build.mcu=atmega1608
megaAVR0.menu.01_variant.ATmega1608_32P.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.ATmega1608_32P.upload.maximum_data_size=2048
megaAVR0.menu.01_variant.ATmega1608_32P.upload.maximum_size=15872

megaAVR0.menu.01_variant.ATmega808_32P=32pin ATmega808 (8KiB+1KiB)
megaAVR0.menu.01_variant.ATmega808_32P.build.board=AVR_ATMEGA808
megaAVR0.menu.01_variant.ATmega808_32P.build.mcu=atmega808
megaAVR0.menu.01_variant.ATmega808_32P.build.variant=megaAVR0_32
megaAVR0.menu.01_variant.ATmega808_32P.upload.maximum_data_size=1024
megaAVR0.menu.01_variant.ATmega808_32P.upload.maximum_size=7680

megaAVR0.menu.01_variant.separator3=-

megaAVR0.menu.01_variant.ATmega4808_28P=28pin ATmega4808 (48KiB+6KiB)
megaAVR0.menu.01_variant.ATmega4808_28P.build.board=AVR_ATMEGA4808
megaAVR0.menu.01_variant.ATmega4808_28P.build.mcu=atmega4808
megaAVR0.menu.01_variant.ATmega4808_28P.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.ATmega4808_28P.upload.maximum_data_size=6144
megaAVR0.menu.01_variant.ATmega4808_28P.upload.maximum_size=48640

megaAVR0.menu.01_variant.ATmega3208_28P=28pin ATmega3208 (32KiB+4KiB)
megaAVR0.menu.01_variant.ATmega3208_28P.build.board=AVR_ATMEGA3208
megaAVR0.menu.01_variant.ATmega3208_28P.build.mcu=atmega3208
megaAVR0.menu.01_variant.ATmega3208_28P.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.ATmega3208_28P.upload.maximum_data_size=4096
megaAVR0.menu.01_variant.ATmega3208_28P.upload.maximum_size=32256

