askn37/multix-zinnia-sdk-megaAVR/boards.txt
megaAVR0.menu.01_variant.ATmega1608_28P=28pin ATmega1608 (16KiB+2KiB)
megaAVR0.menu.01_variant.ATmega1608_28P.build.board=AVR_ATMEGA1608
megaAVR0.menu.01_variant.ATmega1608_28P.build.mcu=atmega1608
megaAVR0.menu.01_variant.ATmega1608_28P.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.ATmega1608_28P.upload.maximum_data_size=2048
megaAVR0.menu.01_variant.ATmega1608_28P.upload.maximum_size=15872

megaAVR0.menu.01_variant.ATmega808_28P=28pin ATmega808 (8KiB+1KiB)
megaAVR0.menu.01_variant.ATmega808_28P.build.board=AVR_ATMEGA808
megaAVR0.menu.01_variant.ATmega808_28P.build.mcu=atmega808
megaAVR0.menu.01_variant.ATmega808_28P.build.variant=megaAVR0_28
megaAVR0.menu.01_variant.ATmega808_28P.upload.maximum_data_size=1024
megaAVR0.menu.01_variant.ATmega808_28P.upload.maximum_size=7680

megaAVR0.menu.02_clock.20MHz=Internal 20 MHz
megaAVR0.menu.02_clock.20MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.20MHz.build.f_cpu=20000000L

megaAVR0.menu.02_clock.10MHz=Internal 10 MHz
megaAVR0.menu.02_clock.10MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.10MHz.build.f_cpu=10000000L

megaAVR0.menu.02_clock.5MHz=Internal 5 MHz
megaAVR0.menu.02_clock.5MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.5MHz.build.f_cpu=5000000L

megaAVR0.menu.02_clock.separator1=-

megaAVR0.menu.02_clock.16MHz=Internal 16 MHz
megaAVR0.menu.02_clock.16MHz.bootloader.OSCCFG=0x7D
megaAVR0.menu.02_clock.16MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.16MHz.build.f_cpu=16000000L

megaAVR0.menu.02_clock.8MHz=Internal 8 MHz
megaAVR0.menu.02_clock.8MHz.bootloader.OSCCFG=0x7D
megaAVR0.menu.02_clock.8MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.8MHz.build.f_cpu=8000000L

megaAVR0.menu.02_clock.4MHz=Internal 4 MHz
megaAVR0.menu.02_clock.4MHz.bootloader.OSCCFG=0x7D
megaAVR0.menu.02_clock.4MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.4MHz.build.f_cpu=4000000L

megaAVR0.menu.02_clock.1MHz=Internal 1 MHz
megaAVR0.menu.02_clock.1MHz.bootloader.OSCCFG=0x7D
megaAVR0.menu.02_clock.1MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.1MHz.build.f_cpu=1000000L

megaAVR0.menu.02_clock.separator2=-

megaAVR0.menu.02_clock.2MHz=Internal 2 MHz
megaAVR0.menu.02_clock.2MHz.bootloader.bod_sample=0
megaAVR0.menu.02_clock.2MHz.build.f_cpu=2000000L

megaAVR0.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)
megaAVR0.menu.02_clock.32768Hz.bootloader.bod_sample=1
megaAVR0.menu.02_clock.32768Hz.build.f_cpu=32768L

# megaAVR0.menu.11_BODMODE.Disabled=BOD Disabled
# megaAVR0.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# megaAVR0.menu.11_BODMODE.Enabled=BOD Enabled
# megaAVR0.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# megaAVR0.menu.11_BODMODE.Sampled=BOD Sampled
# megaAVR0.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# megaAVR0.menu.11_BODMODE.Enablewait=BOD Enabled hold wakeup
# megaAVR0.menu.11_BODMODE.Enablewait.bootloader.bod_mode=11

# megaAVR0.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
# megaAVR0.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# megaAVR0.menu.12_BODLVL.BODLEVEL2=Level 2.6V
# megaAVR0.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# megaAVR0.menu.12_BODLVL.BODLEVEL7=Level 4.3V
# megaAVR0.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111

megaAVR0.menu.21_resetpin.Reset=Reset
megaAVR0.menu.21_resetpin.Reset.bootloader.reset_bit=11

megaAVR0.menu.21_resetpin.Gpio=GPIO (input only)
megaAVR0.menu.21_resetpin.Gpio.bootloader.reset_bit=01

megaAVR0.menu.24_eeprom.Retained=Save guard "Retained"
megaAVR0.menu.24_eeprom.Retained.bootloader.eesave_bit=1

megaAVR0.menu.24_eeprom.Erase=Save guard "Erase"
megaAVR0.menu.24_eeprom.Erase.bootloader.eesave_bit=0

megaAVR0.menu.24_eeprom.Upload="Erase" and "Replace"
megaAVR0.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
megaAVR0.menu.24_eeprom.Upload.bootloader.eesave_bit=1

megaAVR0.menu.26_userrow.Keep=Save guard "Retained"

megaAVR0.menu.26_userrow.Upload=Upload ".urow" file
megaAVR0.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}

megaAVR0.menu.51_buildopt.Release=Release (default)

megaAVR0.menu.51_buildopt.Debug1=DEBUG=1
megaAVR0.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1

megaAVR0.menu.51_buildopt.Debug2=DEBUG=2
megaAVR0.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2

megaAVR0.menu.52_macroapi.Enable=Macro API Enable (default)

megaAVR0.menu.52_macroapi.WoStartup=Macro API Enable without startup
megaAVR0.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
megaAVR0.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles

megaAVR0.menu.52_macroapi.Disable=Macro API Disable
megaAVR0.menu.52_macroapi.Disable.build.macroapi=

megaAVR0.menu.52_macroapi.AllDisable=Standard Library All Disable
megaAVR0.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
megaAVR0.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib

megaAVR0.menu.53_printf.Default=Integer Only

megaAVR0.menu.53_printf.Full=Float Support
megaAVR0.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
megaAVR0.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt

megaAVR0.menu.90_console_baud.9600bps=9600 bps (default)
megaAVR0.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600

megaAVR0.menu.90_console_baud.38400bps=38400 bps
megaAVR0.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400

megaAVR0.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
megaAVR0.menu.90_console_baud.57600bps=57600 bps

megaAVR0.menu.90_console_baud.115200bps=115200 bps
megaAVR0.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200

megaAVR0.menu.90_console_baud.230400bps=230400 bps
megaAVR0.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400

megaAVR0.menu.90_console_baud.250000bps=250000 bps
megaAVR0.menu.90_console_baud.250000bps.build.console_baud=-DCONSOLE_BAUD=250000

megaAVR0.menu.90_console_baud.500000bps=500000 bps
megaAVR0.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000

megaAVR0.menu.90_console_baud.1000000bps=1000000 bps
megaAVR0.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000

megaAVR0.menu.90_console_baud.separator1=-

megaAVR0.menu.90_console_baud.2400bps=2400 bps (for ULP)
megaAVR0.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400

