askn37/multix-zinnia-sdk-megaAVR/boards.txt
megaAVR0.menu.95_bootloader.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7 (default)
megaAVR0.menu.95_bootloader.UART0_A0_LA7.bootloader.file=hex/boot_atmega_UART0_A0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.UART0_A0_LA7.build.console_select=-DSerial=Serial0A

megaAVR0.menu.95_bootloader.separator1=-

megaAVR0.menu.95_bootloader.UART1_C0_LA7=UART1 TX:PC0 RX:PC1 LED=PA7
megaAVR0.menu.95_bootloader.UART1_C0_LA7.bootloader.file=hex/boot_atmega_UART1_C0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.UART1_C0_LA7.build.console_select=-DSerial=Serial1A

megaAVR0.menu.95_bootloader.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7
megaAVR0.menu.95_bootloader.UART2_F0_LA7.bootloader.file=hex/boot_atmega_UART2_F0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.UART2_F0_LA7.build.console_select=-DSerial=Serial2A

megaAVR0.menu.95_bootloader.UART3_B0_LA7=UART3 TX:PB0 RX:PB1 LED=PA7 (48pin only)
megaAVR0.menu.95_bootloader.UART3_B0_LA7.bootloader.file=hex/boot_atmega_UART3_B0_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.UART3_B0_LA7.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PA7

megaAVR0.menu.95_bootloader.UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48pin only)
megaAVR0.menu.95_bootloader.UART2_F4_LA7.bootloader.file=hex/boot_atmega_UART2_F4_{upload.speed}_LA7.hex
megaAVR0.menu.95_bootloader.UART2_F4_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7

megaAVR0.menu.95_bootloader.separator2=-

megaAVR0.menu.95_bootloader.UART3_B0_LF5_SF6_Curiosity=UART3 TX:PB0 RX:PB1 LED=PF5 SW=PF6 (ATmega4809 Curiosity Nano)
megaAVR0.menu.95_bootloader.UART3_B0_LF5_SF6_Curiosity.bootloader.file=hex/boot_atmega_UART3_B0_{upload.speed}_LF5.hex
megaAVR0.menu.95_bootloader.UART3_B0_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6


tinyAVR012.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR012.bootloader.BOOTSIZE=0x02
tinyAVR012.bootloader.CODESIZE=0x00
tinyAVR012.bootloader.OSCCFG=0x7E
tinyAVR012.bootloader.SYSCFG0=0b1101{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR012.bootloader.SYSCFG1=0xFF
tinyAVR012.bootloader.WDTCFG=0x00
tinyAVR012.bootloader.bod_lvl=000
tinyAVR012.bootloader.bod_mode=00
tinyAVR012.bootloader.bod_sample=0
tinyAVR012.bootloader.eepupload=
tinyAVR012.bootloader.urowupload=
tinyAVR012.bootloader.fuseupload={bootloader.fuses}
tinyAVR012.bootloader.eesave_bit=1
tinyAVR012.bootloader.reset_bit=01
tinyAVR012.bootloader.tool=avrdude
tinyAVR012.bootloader.programed_type=.with_bootloader
tinyAVR012.build.export_merged_output=true
tinyAVR012.build.text_section_start=.text=0x200
tinyAVR012.build.buildopt=-DNDEBUG
tinyAVR012.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012.build.macroapi=-DENABLE_MACRO_API
tinyAVR012.build.printf=
tinyAVR012.build.printflt=
tinyAVR012.build.linker_script=avrxmega3_p64.x
tinyAVR012.upload.protocol=arduino
tinyAVR012.upload.speed=115200
tinyAVR012.upload.tool=avrdude

tinyAVR012.menu.01_variant.ATtiny3227.build.board=AVR_ATTINY3227
tinyAVR012.menu.01_variant.ATtiny3227.build.mcu=attiny3227
tinyAVR012.menu.01_variant.ATtiny3227.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.ATtiny3227.build.linker_script=avrxmega3_p128.x
tinyAVR012.menu.01_variant.ATtiny3227.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.ATtiny3227.upload.maximum_size=32768
tinyAVR012.menu.01_variant.ATtiny3227=tinyAVR-2 24pin ATtiny3227 (32KiB+3KiB)

tinyAVR012.menu.01_variant.ATtiny1627.build.board=AVR_ATTINY1627
tinyAVR012.menu.01_variant.ATtiny1627.build.mcu=attiny1627
tinyAVR012.menu.01_variant.ATtiny1627.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.ATtiny1627.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny1627.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1627=tinyAVR-2 24pin ATtiny1627 (16KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny827.build.board=AVR_ATTINY827
tinyAVR012.menu.01_variant.ATtiny827.build.mcu=attiny827
tinyAVR012.menu.01_variant.ATtiny827.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.ATtiny827.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.ATtiny827.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny827=tinyAVR-2 24pin ATtiny827 (8KiB+1KiB)

tinyAVR012.menu.01_variant.ATtiny427.build.board=AVR_ATTINY427
tinyAVR012.menu.01_variant.ATtiny427.build.mcu=attiny427
tinyAVR012.menu.01_variant.ATtiny427.build.variant=tinyAVR2_24
tinyAVR012.menu.01_variant.ATtiny427.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny427.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny427=tinyAVR-2 24pin ATtiny427 (4KiB+512B)

tinyAVR012.menu.01_variant.separator1=-

tinyAVR012.menu.01_variant.ATtiny3226.build.board=AVR_ATTINY3226
tinyAVR012.menu.01_variant.ATtiny3226.build.mcu=attiny3226
tinyAVR012.menu.01_variant.ATtiny3226.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.ATtiny3226.build.linker_script=avrxmega3_p128.x
tinyAVR012.menu.01_variant.ATtiny3226.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.ATtiny3226.upload.maximum_size=32768
tinyAVR012.menu.01_variant.ATtiny3226=tinyAVR-2 20pin ATtiny3226 (32KiB+3KiB)

tinyAVR012.menu.01_variant.ATtiny1626.build.board=AVR_ATTINY1626
tinyAVR012.menu.01_variant.ATtiny1626.build.mcu=attiny1626
tinyAVR012.menu.01_variant.ATtiny1626.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.ATtiny1626.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny1626.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1626=tinyAVR-2 20pin ATtiny1626 (16KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny826.build.board=AVR_ATTINY826
tinyAVR012.menu.01_variant.ATtiny826.build.mcu=attiny826
tinyAVR012.menu.01_variant.ATtiny826.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.ATtiny826.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.ATtiny826.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny826=tinyAVR-2 20pin ATtiny826 (8KiB+1KiB)

tinyAVR012.menu.01_variant.ATtiny426.build.board=AVR_ATTINY426
tinyAVR012.menu.01_variant.ATtiny426.build.mcu=attiny426
tinyAVR012.menu.01_variant.ATtiny426.build.variant=tinyAVR2_20
tinyAVR012.menu.01_variant.ATtiny426.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny426.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny426=tinyAVR-2 20pin ATtiny426 (4KiB+512B)

tinyAVR012.menu.01_variant.separator2=-

