askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012.menu.01_variant.ATtiny3224.build.board=AVR_ATTINY3224
tinyAVR012.menu.01_variant.ATtiny3224.build.mcu=attiny3224
tinyAVR012.menu.01_variant.ATtiny3224.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.ATtiny3224.build.linker_script=avrxmega3_p128.x
tinyAVR012.menu.01_variant.ATtiny3224.upload.maximum_data_size=3072
tinyAVR012.menu.01_variant.ATtiny3224.upload.maximum_size=32768
tinyAVR012.menu.01_variant.ATtiny3224=tinyAVR-2 14pin ATtiny3224 (32KiB+3KiB)

tinyAVR012.menu.01_variant.ATtiny1624.build.board=AVR_ATTINY1624
tinyAVR012.menu.01_variant.ATtiny1624.build.mcu=attiny1624
tinyAVR012.menu.01_variant.ATtiny1624.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.ATtiny1624.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny1624.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1624=tinyAVR-2 14pin ATtiny1624 (16KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny824.build.board=AVR_ATTINY824
tinyAVR012.menu.01_variant.ATtiny824.build.mcu=attiny824
tinyAVR012.menu.01_variant.ATtiny824.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.ATtiny824.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.ATtiny824.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny824=tinyAVR-2 14pin ATtiny824 (8KiB+1KiB)

tinyAVR012.menu.01_variant.ATtiny424.build.board=AVR_ATTINY424
tinyAVR012.menu.01_variant.ATtiny424.build.mcu=attiny424
tinyAVR012.menu.01_variant.ATtiny424.build.variant=tinyAVR2_14
tinyAVR012.menu.01_variant.ATtiny424.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny424.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny424=tinyAVR-2 14pin ATtiny424 (4KiB+512B)

tinyAVR012.menu.01_variant.separator3=-

tinyAVR012.menu.01_variant.ATtiny3217.build.board=AVR_ATTINY3217
tinyAVR012.menu.01_variant.ATtiny3217.build.mcu=attiny3217
tinyAVR012.menu.01_variant.ATtiny3217.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.ATtiny3217.build.linker_script=avrxmega3_p128.x
tinyAVR012.menu.01_variant.ATtiny3217.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny3217.upload.maximum_size=32768
tinyAVR012.menu.01_variant.ATtiny3217=tinyAVR-1 24pin ATtiny3217 (32KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny1617.build.board=AVR_ATTINY1617
tinyAVR012.menu.01_variant.ATtiny1617.build.mcu=attiny1617
tinyAVR012.menu.01_variant.ATtiny1617.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.ATtiny1617.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny1617.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1617=tinyAVR-1 24pin ATtiny1617 (16KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny817.build.board=AVR_ATTINY817
tinyAVR012.menu.01_variant.ATtiny817.build.mcu=attiny817
tinyAVR012.menu.01_variant.ATtiny817.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.ATtiny817.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny817.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny817=tinyAVR-1 24pin ATtiny817 (8KiB+512B)

tinyAVR012.menu.01_variant.ATtiny417.build.board=AVR_ATTINY417
tinyAVR012.menu.01_variant.ATtiny417.build.mcu=attiny417
tinyAVR012.menu.01_variant.ATtiny417.build.variant=tinyAVR1_24
tinyAVR012.menu.01_variant.ATtiny417.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.ATtiny417.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny417=tinyAVR-1 24pin ATtiny417 (4KiB+256B)

tinyAVR012.menu.01_variant.separator4=-

tinyAVR012.menu.01_variant.ATtiny3216.build.board=AVR_ATTINY3216
tinyAVR012.menu.01_variant.ATtiny3216.build.mcu=attiny3216
tinyAVR012.menu.01_variant.ATtiny3216.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.ATtiny3216.build.linker_script=avrxmega3_p128.x
tinyAVR012.menu.01_variant.ATtiny3216.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny3216.upload.maximum_size=32768
tinyAVR012.menu.01_variant.ATtiny3216=tinyAVR-1 20pin ATtiny3216 (32KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny1616.build.board=AVR_ATTINY1616
tinyAVR012.menu.01_variant.ATtiny1616.build.mcu=attiny1616
tinyAVR012.menu.01_variant.ATtiny1616.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.ATtiny1616.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny1616.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1616=tinyAVR-1 20pin ATtiny1616 (16KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny816.build.board=AVR_ATTINY816
tinyAVR012.menu.01_variant.ATtiny816.build.mcu=attiny816
tinyAVR012.menu.01_variant.ATtiny816.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.ATtiny816.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny816.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny816=tinyAVR-1 20pin ATtiny816 (8KiB+512B)

tinyAVR012.menu.01_variant.ATtiny416.build.board=AVR_ATTINY416
tinyAVR012.menu.01_variant.ATtiny416.build.mcu=attiny416
tinyAVR012.menu.01_variant.ATtiny416.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.ATtiny416.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.ATtiny416.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny416=tinyAVR-1 20pin ATtiny416 (4KiB+256B)

tinyAVR012.menu.01_variant.ATtiny416auto.build.board=AVR_ATTINY416
tinyAVR012.menu.01_variant.ATtiny416auto.build.mcu=attiny416auto
tinyAVR012.menu.01_variant.ATtiny416auto.build.variant=tinyAVR1_20
tinyAVR012.menu.01_variant.ATtiny416auto.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.ATtiny416auto.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny416auto=tinyAVR-1 20pin ATtiny416auto (4KiB+256B)

tinyAVR012.menu.01_variant.separator5=-

tinyAVR012.menu.01_variant.ATtiny1614.build.board=AVR_ATTINY1614
tinyAVR012.menu.01_variant.ATtiny1614.build.mcu=attiny1614
tinyAVR012.menu.01_variant.ATtiny1614.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.ATtiny1614.upload.maximum_data_size=2048
tinyAVR012.menu.01_variant.ATtiny1614.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1614=tinyAVR-1 14pin ATtiny1614 (16KiB+2KiB)

tinyAVR012.menu.01_variant.ATtiny814.build.board=AVR_ATTINY814
tinyAVR012.menu.01_variant.ATtiny814.build.mcu=attiny814
tinyAVR012.menu.01_variant.ATtiny814.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.ATtiny814.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny814.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny814=tinyAVR-1 14pin ATtiny814 (8KiB+512B)

tinyAVR012.menu.01_variant.ATtiny414.build.board=AVR_ATTINY414
tinyAVR012.menu.01_variant.ATtiny414.build.mcu=attiny414
tinyAVR012.menu.01_variant.ATtiny414.build.variant=tinyAVR1_14
tinyAVR012.menu.01_variant.ATtiny414.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.ATtiny414.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny414=tinyAVR-1 14pin ATtiny414 (4KiB+256B)

tinyAVR012.menu.01_variant.separator6=-

tinyAVR012.menu.01_variant.ATtiny1607.build.board=AVR_ATTINY1607
tinyAVR012.menu.01_variant.ATtiny1607.build.mcu=attiny1607
tinyAVR012.menu.01_variant.ATtiny1607.build.variant=tinyAVR0_24
tinyAVR012.menu.01_variant.ATtiny1607.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.ATtiny1607.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1607=tinyAVR-0 24pin ATtiny1607 (16KiB+1KiB)

