askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012.menu.01_variant.ATtiny807.build.board=AVR_ATTINY807
tinyAVR012.menu.01_variant.ATtiny807.build.mcu=attiny807
tinyAVR012.menu.01_variant.ATtiny807.build.variant=tinyAVR0_24
tinyAVR012.menu.01_variant.ATtiny807.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny807.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny807=tinyAVR-0 24pin ATtiny807 (8KiB+512B)

tinyAVR012.menu.01_variant.separator7=-

tinyAVR012.menu.01_variant.ATtiny1606.build.board=AVR_ATTINY1606
tinyAVR012.menu.01_variant.ATtiny1606.build.mcu=attiny1606
tinyAVR012.menu.01_variant.ATtiny1606.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.ATtiny1606.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.ATtiny1606.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1606=tinyAVR-0 20pin ATtiny1606 (16KiB+1KiB)

tinyAVR012.menu.01_variant.ATtiny806.build.board=AVR_ATTINY806
tinyAVR012.menu.01_variant.ATtiny806.build.mcu=attiny806
tinyAVR012.menu.01_variant.ATtiny806.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.ATtiny806.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny806.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny806=tinyAVR-0 20pin ATtiny806 (8KiB+512B)

tinyAVR012.menu.01_variant.ATtiny406.build.board=AVR_ATTINY406
tinyAVR012.menu.01_variant.ATtiny406.build.mcu=attiny406
tinyAVR012.menu.01_variant.ATtiny406.build.variant=tinyAVR0_20
tinyAVR012.menu.01_variant.ATtiny406.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.ATtiny406.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny406=tinyAVR-0 20pin ATtiny406 (4KiB+256B)

tinyAVR012.menu.01_variant.separator8=-

tinyAVR012.menu.01_variant.ATtiny1604.build.board=AVR_ATTINY1604
tinyAVR012.menu.01_variant.ATtiny1604.build.mcu=attiny1604
tinyAVR012.menu.01_variant.ATtiny1604.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.ATtiny1604.upload.maximum_data_size=1024
tinyAVR012.menu.01_variant.ATtiny1604.upload.maximum_size=15872
tinyAVR012.menu.01_variant.ATtiny1604=tinyAVR-0 14pin ATtiny1604 (16KiB+1KiB)

tinyAVR012.menu.01_variant.ATtiny804.build.board=AVR_ATTINY804
tinyAVR012.menu.01_variant.ATtiny804.build.mcu=attiny804
tinyAVR012.menu.01_variant.ATtiny804.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.ATtiny804.upload.maximum_data_size=512
tinyAVR012.menu.01_variant.ATtiny804.upload.maximum_size=7680
tinyAVR012.menu.01_variant.ATtiny804=tinyAVR-0 14pin ATtiny804 (8KiB+512B)

tinyAVR012.menu.01_variant.ATtiny404.build.board=AVR_ATTINY404
tinyAVR012.menu.01_variant.ATtiny404.build.mcu=attiny404
tinyAVR012.menu.01_variant.ATtiny404.build.variant=tinyAVR0_14
tinyAVR012.menu.01_variant.ATtiny404.upload.maximum_data_size=256
tinyAVR012.menu.01_variant.ATtiny404.upload.maximum_size=3584
tinyAVR012.menu.01_variant.ATtiny404=tinyAVR-0 14pin ATtiny404 (4KiB+256B)

tinyAVR012.menu.02_clock.20MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.20MHz.build.f_cpu=20000000L
tinyAVR012.menu.02_clock.20MHz=Internal 20 MHz

tinyAVR012.menu.02_clock.10MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.10MHz.build.f_cpu=10000000L
tinyAVR012.menu.02_clock.10MHz=Internal 10 MHz

tinyAVR012.menu.02_clock.5MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.5MHz.build.f_cpu=5000000L
tinyAVR012.menu.02_clock.5MHz=Internal 5 MHz

tinyAVR012.menu.02_clock.separator1=-

tinyAVR012.menu.02_clock.16MHz.bootloader.OSCCFG=0x7D
tinyAVR012.menu.02_clock.16MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.16MHz.build.f_cpu=16000000L
tinyAVR012.menu.02_clock.16MHz=Internal 16 MHz

tinyAVR012.menu.02_clock.8MHz.bootloader.OSCCFG=0x7D
tinyAVR012.menu.02_clock.8MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.8MHz.build.f_cpu=8000000L
tinyAVR012.menu.02_clock.8MHz=Internal 8 MHz

tinyAVR012.menu.02_clock.4MHz.bootloader.OSCCFG=0x7D
tinyAVR012.menu.02_clock.4MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.4MHz.build.f_cpu=4000000L
tinyAVR012.menu.02_clock.4MHz=Internal 4 MHz

tinyAVR012.menu.02_clock.1MHz.bootloader.OSCCFG=0x7D
tinyAVR012.menu.02_clock.1MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.1MHz.build.f_cpu=1000000L
tinyAVR012.menu.02_clock.1MHz=Internal 1 MHz

tinyAVR012.menu.02_clock.separator2=-

tinyAVR012.menu.02_clock.2MHz.bootloader.bod_sample=0
tinyAVR012.menu.02_clock.2MHz.build.f_cpu=2000000L
tinyAVR012.menu.02_clock.2MHz=Internal 2 MHz

tinyAVR012.menu.02_clock.32768Hz.bootloader.bod_sample=1
tinyAVR012.menu.02_clock.32768Hz.build.f_cpu=32768L
tinyAVR012.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# tinyAVR012.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# tinyAVR012.menu.11_BODMODE.Disabled=BOD Disabled
# tinyAVR012.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# tinyAVR012.menu.11_BODMODE.Enabled=BOD Enabled
# tinyAVR012.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# tinyAVR012.menu.11_BODMODE.Sampled=BOD Sampled
# tinyAVR012.menu.11_BODMODE.Enablewait.bootloader.bod_mode=11
# tinyAVR012.menu.11_BODMODE.Enablewait=BOD Enabled hold wakeup

# tinyAVR012.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# tinyAVR012.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
# tinyAVR012.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# tinyAVR012.menu.12_BODLVL.BODLEVEL2=Level 2.6V
# tinyAVR012.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
# tinyAVR012.menu.12_BODLVL.BODLEVEL7=Level 4.3V

# tinyAVR012.menu.22_updipin.Updi.bootloader.reset_bit=01
# tinyAVR012.menu.22_updipin.Updi=PA0 pin=UPDI (default)
# tinyAVR012.menu.22_updipin.ResetAlt.bootloader.reset_bit=11
# tinyAVR012.menu.22_updipin.ResetAlt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
# tinyAVR012.menu.22_updipin.separator1=-
# tinyAVR012.menu.22_updipin.Reset.bootloader.reset_bit=10
# tinyAVR012.menu.22_updipin.Reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
# tinyAVR012.menu.22_updipin.Gpio.bootloader.reset_bit=00
# tinyAVR012.menu.22_updipin.Gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)

tinyAVR012.menu.24_eeprom.Retained.bootloader.eesave_bit=1
tinyAVR012.menu.24_eeprom.Retained=Save guard "Retained"

tinyAVR012.menu.24_eeprom.Erase.bootloader.eesave_bit=0
tinyAVR012.menu.24_eeprom.Erase=Save guard "Erase"

tinyAVR012.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
tinyAVR012.menu.24_eeprom.Upload.bootloader.eesave_bit=1
tinyAVR012.menu.24_eeprom.Upload="Erase" and "Replace"

tinyAVR012.menu.26_userrow.Keep=Save guard "Retained"

tinyAVR012.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
tinyAVR012.menu.26_userrow.Upload=Upload ".urow" file

tinyAVR012.menu.51_buildopt.Release=Release (default)

tinyAVR012.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
tinyAVR012.menu.51_buildopt.Debug1=DEBUG=1

tinyAVR012.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
tinyAVR012.menu.51_buildopt.Debug2=DEBUG=2

tinyAVR012.menu.52_macroapi.Enable=Macro API Enable (default)

tinyAVR012.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
tinyAVR012.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
tinyAVR012.menu.52_macroapi.WoStartup=Macro API Enable without startup

