askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012.menu.52_macroapi.Disable.build.macroapi=
tinyAVR012.menu.52_macroapi.Disable=Macro API Disable

tinyAVR012.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
tinyAVR012.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
tinyAVR012.menu.52_macroapi.AllDisable=Standard Library All Disable

tinyAVR012.menu.53_printf.Default=Integer Only

tinyAVR012.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
tinyAVR012.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR012.menu.53_printf.Full=Float Support

tinyAVR012.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012.menu.90_console_baud.9600bps=9600 bps (default)

tinyAVR012.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR012.menu.90_console_baud.38400bps=38400 bps

tinyAVR012.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR012.menu.90_console_baud.57600bps=57600 bps

tinyAVR012.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR012.menu.90_console_baud.115200bps=115200 bps

tinyAVR012.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR012.menu.90_console_baud.230400bps=230400 bps

tinyAVR012.menu.90_console_baud.250000bps.build.console_baud=-DCONSOLE_BAUD=250000
tinyAVR012.menu.90_console_baud.250000bps=250000 bps

tinyAVR012.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
tinyAVR012.menu.90_console_baud.500000bps=500000 bps

tinyAVR012.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR012.menu.90_console_baud.1000000bps=1000000 bps

tinyAVR012.menu.90_console_baud.separator1=-

tinyAVR012.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR012.menu.90_console_baud.2400bps=2400 bps (for ULP)

tinyAVR012.menu.95_bootloader.UART0_B2_LA7.bootloader.file=hex/boot_attiny_UART0_B2_{upload.speed}_LA7.hex
tinyAVR012.menu.95_bootloader.UART0_B2_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
tinyAVR012.menu.95_bootloader.UART0_B2_LA7=UART0 TX:PB2 RX:PB3 LED=PA7 (default)

tinyAVR012.menu.95_bootloader.separator1=-

tinyAVR012.menu.95_bootloader.UART0_A1_LA7_.bootloader.file=hex/boot_attiny_UART0_A1_{upload.speed}_LA7.hex
tinyAVR012.menu.95_bootloader.UART0_A1_LA7_.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PA7
tinyAVR012.menu.95_bootloader.UART0_A1_LA7_=UART0 TX:PA1 RX:PA2 LED=PA7 (alternative)

tinyAVR012.menu.95_bootloader.UART1_C2_LA7.bootloader.file=hex/boot_attiny_UART1_C2_{upload.speed}_LA7.hex
tinyAVR012.menu.95_bootloader.UART1_C2_LA7.build.console_select=-DSerial=Serial1B -DLED_BUILTIN=PIN_PA7
tinyAVR012.menu.95_bootloader.UART1_C2_LA7=UART1 TX:PC2 RX:PC1 LED=PA7 (tinyAVR-2 20/24pin only)

tinyAVR012.menu.95_bootloader.UART0_B2_LB2_SC4_Curiosity.bootloader.file=hex/boot_attiny_UART0_B2_{upload.speed}_LB7.hex
tinyAVR012.menu.95_bootloader.UART0_B2_LB2_SC4_Curiosity.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PB7 -DSW_BUILTIN=PIN_PC4
tinyAVR012.menu.95_bootloader.UART0_B2_LB2_SC4_Curiosity=UART0 TX:PB2 RX:PB3 LED=PB7 SW=PC4 (ATtiny1607/1627 Curiosity Nano)

tinyAVR012.menu.95_bootloader.separator2=-

tinyAVR012.menu.95_bootloader.UART0_B2_LA3_SB7_Curiosity.bootloader.file=hex/boot_attiny_UART0_B2_{upload.speed}_LA3.hex
tinyAVR012.menu.95_bootloader.UART0_B2_LA3_SB7_Curiosity.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA3 -DSW_BUILTIN=PIN_PB7
tinyAVR012.menu.95_bootloader.UART0_B2_LA3_SB7_Curiosity=UART0 TX:PB2 RX:PB3 LED=PA3 SW=PB7 (ATtiny3217 Curiosity Nano)


tinyAVR01.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR01.bootloader.BOOTSIZE=0x02
tinyAVR01.bootloader.CODESIZE=0x00
tinyAVR01.bootloader.OSCCFG=0x7E
tinyAVR01.bootloader.SYSCFG0=0b1101{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR01.bootloader.SYSCFG1=0xFF
tinyAVR01.bootloader.WDTCFG=0x00
tinyAVR01.bootloader.bod_lvl=000
tinyAVR01.bootloader.bod_mode=00
tinyAVR01.bootloader.bod_sample=0
tinyAVR01.bootloader.eepupload=
tinyAVR01.bootloader.urowupload=
tinyAVR01.bootloader.fuseupload={bootloader.fuses}
tinyAVR01.bootloader.eesave_bit=1
tinyAVR01.bootloader.reset_bit=01
tinyAVR01.bootloader.tool=avrdude
tinyAVR01.bootloader.programed_type=.with_bootloader
tinyAVR01.build.export_merged_output=true
tinyAVR01.build.text_section_start=.text=0x200
tinyAVR01.build.buildopt=-DNDEBUG
tinyAVR01.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR01.build.macroapi=-DENABLE_MACRO_API
tinyAVR01.build.printf=
tinyAVR01.build.printflt=
tinyAVR01.build.linker_script=avrxmega3_p64.x
tinyAVR01.upload.protocol=arduino
tinyAVR01.upload.speed=115200
tinyAVR01.upload.tool=avrdude

tinyAVR01.menu.01_variant.ATtiny412.build.board=AVR_ATTINY412
tinyAVR01.menu.01_variant.ATtiny412.build.mcu=attiny412
tinyAVR01.menu.01_variant.ATtiny412.build.variant=tinyAVR1_8
tinyAVR01.menu.01_variant.ATtiny412.upload.maximum_data_size=256
tinyAVR01.menu.01_variant.ATtiny412.upload.maximum_size=3584
tinyAVR01.menu.01_variant.ATtiny412=tinyAVR-1 8pin ATtiny412 (4KiB+256B)

tinyAVR01.menu.01_variant.ATtiny212.build.board=AVR_ATTINY212
tinyAVR01.menu.01_variant.ATtiny212.build.mcu=attiny212
tinyAVR01.menu.01_variant.ATtiny212.build.variant=tinyAVR1_8
tinyAVR01.menu.01_variant.ATtiny212.upload.maximum_data_size=128
tinyAVR01.menu.01_variant.ATtiny212.upload.maximum_size=1536
tinyAVR01.menu.01_variant.ATtiny212=tinyAVR-1 8pin ATtiny212 (2KiB+128B)

tinyAVR01.menu.01_variant.separator1=-

tinyAVR01.menu.01_variant.ATtiny402.build.board=AVR_ATTINY402
tinyAVR01.menu.01_variant.ATtiny402.build.mcu=attiny402
tinyAVR01.menu.01_variant.ATtiny402.build.variant=tinyAVR0_8
tinyAVR01.menu.01_variant.ATtiny402.upload.maximum_data_size=256
tinyAVR01.menu.01_variant.ATtiny402.upload.maximum_size=3584
tinyAVR01.menu.01_variant.ATtiny402=tinyAVR-0 8pin ATtiny402 (4KiB+256B)

tinyAVR01.menu.01_variant.ATtiny202.build.board=AVR_ATTINY202
tinyAVR01.menu.01_variant.ATtiny202.build.mcu=attiny202
tinyAVR01.menu.01_variant.ATtiny202.build.variant=tinyAVR0_8
tinyAVR01.menu.01_variant.ATtiny202.upload.maximum_data_size=128
tinyAVR01.menu.01_variant.ATtiny202.upload.maximum_size=1536
tinyAVR01.menu.01_variant.ATtiny202=tinyAVR-0 8pin ATtiny202 (2KiB+128B)

tinyAVR01.menu.02_clock.20MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.20MHz.build.f_cpu=20000000L
tinyAVR01.menu.02_clock.20MHz=Internal 20 MHz

tinyAVR01.menu.02_clock.10MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.10MHz.build.f_cpu=10000000L
tinyAVR01.menu.02_clock.10MHz=Internal 10 MHz

tinyAVR01.menu.02_clock.5MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.5MHz.build.f_cpu=5000000L
tinyAVR01.menu.02_clock.5MHz=Internal 5 MHz

