askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR01.menu.02_clock.separator1=-

tinyAVR01.menu.02_clock.16MHz.bootloader.OSCCFG=0x7D
tinyAVR01.menu.02_clock.16MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.16MHz.build.f_cpu=16000000L
tinyAVR01.menu.02_clock.16MHz=Internal 16 MHz

tinyAVR01.menu.02_clock.8MHz.bootloader.OSCCFG=0x7D
tinyAVR01.menu.02_clock.8MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.8MHz.build.f_cpu=8000000L
tinyAVR01.menu.02_clock.8MHz=Internal 8 MHz

tinyAVR01.menu.02_clock.4MHz.bootloader.OSCCFG=0x7D
tinyAVR01.menu.02_clock.4MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.4MHz.build.f_cpu=4000000L
tinyAVR01.menu.02_clock.4MHz=Internal 4 MHz

tinyAVR01.menu.02_clock.1MHz.bootloader.OSCCFG=0x7D
tinyAVR01.menu.02_clock.1MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.1MHz.build.f_cpu=1000000L
tinyAVR01.menu.02_clock.1MHz=Internal 1 MHz

tinyAVR01.menu.02_clock.separator2=-

tinyAVR01.menu.02_clock.2MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.2MHz.build.f_cpu=2000000L
tinyAVR01.menu.02_clock.2MHz=Internal 2 MHz

tinyAVR01.menu.02_clock.32768Hz.bootloader.bod_sample=1
tinyAVR01.menu.02_clock.32768Hz.build.f_cpu=32768L
tinyAVR01.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# tinyAVR01.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# tinyAVR01.menu.11_BODMODE.Disabled=BOD Disabled
# tinyAVR01.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# tinyAVR01.menu.11_BODMODE.Enabled=BOD Enabled
# tinyAVR01.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# tinyAVR01.menu.11_BODMODE.Sampled=BOD Sampled
# tinyAVR01.menu.11_BODMODE.Enablewait.bootloader.bod_mode=11
# tinyAVR01.menu.11_BODMODE.Enablewait=BOD Enabled hold wakeup

# tinyAVR01.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# tinyAVR01.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
# tinyAVR01.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# tinyAVR01.menu.12_BODLVL.BODLEVEL2=Level 2.6V
# tinyAVR01.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
# tinyAVR01.menu.12_BODLVL.BODLEVEL7=Level 4.3V

# tinyAVR01.menu.22_updipin.Updi.bootloader.reset_bit=01
# tinyAVR01.menu.22_updipin.Updi=PA0 pin=UPDI (default)
# tinyAVR01.menu.22_updipin.separator1=-
# tinyAVR01.menu.22_updipin.Reset.bootloader.reset_bit=10
# tinyAVR01.menu.22_updipin.Reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
# tinyAVR01.menu.22_updipin.Gpio.bootloader.reset_bit=00
# tinyAVR01.menu.22_updipin.Gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)

tinyAVR01.menu.24_eeprom.Retained.bootloader.eesave_bit=1
tinyAVR01.menu.24_eeprom.Retained=Save guard "Retained"
tinyAVR01.menu.24_eeprom.Erase.bootloader.eesave_bit=0
tinyAVR01.menu.24_eeprom.Erase=Save guard "Erase"
tinyAVR01.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
tinyAVR01.menu.24_eeprom.Upload.bootloader.eesave_bit=1
tinyAVR01.menu.24_eeprom.Upload="Erase" and "Replace"

tinyAVR01.menu.26_userrow.Keep=Save guard "Retained"
tinyAVR01.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
tinyAVR01.menu.26_userrow.Upload=Upload ".urow" file

tinyAVR01.menu.51_buildopt.Release=Release (default)

tinyAVR01.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
tinyAVR01.menu.51_buildopt.Debug1=DEBUG=1

tinyAVR01.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
tinyAVR01.menu.51_buildopt.Debug2=DEBUG=2

tinyAVR01.menu.52_macroapi.Enable=Macro API Enable (default)

tinyAVR01.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
tinyAVR01.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
tinyAVR01.menu.52_macroapi.WoStartup=Macro API Enable without startup

tinyAVR01.menu.52_macroapi.Disable.build.macroapi=
tinyAVR01.menu.52_macroapi.Disable=Macro API Disable

tinyAVR01.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
tinyAVR01.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
tinyAVR01.menu.52_macroapi.AllDisable=Standard Library All Disable

tinyAVR01.menu.53_printf.Default=Integer Only

tinyAVR01.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
tinyAVR01.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR01.menu.53_printf.Full=Float Support

tinyAVR01.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR01.menu.90_console_baud.9600bps=9600 bps (default)

tinyAVR01.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR01.menu.90_console_baud.38400bps=38400 bps

tinyAVR01.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR01.menu.90_console_baud.57600bps=57600 bps

tinyAVR01.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR01.menu.90_console_baud.115200bps=115200 bps

tinyAVR01.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR01.menu.90_console_baud.230400bps=230400 bps

tinyAVR01.menu.90_console_baud.250000bps.build.console_baud=-DCONSOLE_BAUD=250000
tinyAVR01.menu.90_console_baud.250000bps=250000 bps

tinyAVR01.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
tinyAVR01.menu.90_console_baud.500000bps=500000 bps

tinyAVR01.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR01.menu.90_console_baud.1000000bps=1000000 bps

tinyAVR01.menu.90_console_baud.separator1=-

tinyAVR01.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR01.menu.90_console_baud.2400bps=2400 bps (for ULP)

tinyAVR01.menu.95_bootloader.UART0_A6_LA3.bootloader.file=hex/boot_attiny_UART0_A6_{upload.speed}_LA3.hex
tinyAVR01.menu.95_bootloader.UART0_A6_LA3.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA3
tinyAVR01.menu.95_bootloader.UART0_A6_LA3=UART0 TX:PA6 RX:PA7 LED=PA3 (default)

tinyAVR01.menu.95_bootloader.separator1=-

tinyAVR01.menu.95_bootloader.UART0_A1_LA3.bootloader.file=hex/boot_attiny_UART0_A1_{upload.speed}_LA3.hex
tinyAVR01.menu.95_bootloader.UART0_A1_LA3.build.console_select=-DSerial=Serial0B -DLED_BUILTIN=PIN_PA3
tinyAVR01.menu.95_bootloader.UART0_A1_LA3=UART0 TX:PA1 RX:PA2 LED=PA3 (alternative)


megaAVR0_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
megaAVR0_noloader.bootloader.BOOTSIZE=0x00
megaAVR0_noloader.bootloader.CODESIZE=0x00
megaAVR0_noloader.bootloader.OSCCFG=0x7E
megaAVR0_noloader.bootloader.SYSCFG0=0b1101{bootloader.reset_bit}1{bootloader.eesave_bit}
megaAVR0_noloader.bootloader.SYSCFG1=0xFF
megaAVR0_noloader.bootloader.WDTCFG=0x00
megaAVR0_noloader.bootloader.bod_lvl=000
megaAVR0_noloader.bootloader.bod_mode=00
megaAVR0_noloader.bootloader.bod_sample=0
megaAVR0_noloader.bootloader.eepupload=
megaAVR0_noloader.bootloader.urowupload=
megaAVR0_noloader.bootloader.fuseupload={bootloader.fuses}
megaAVR0_noloader.bootloader.eesave_bit=1
megaAVR0_noloader.bootloader.reset_bit=11
megaAVR0_noloader.bootloader.tool=avrdude
megaAVR0_noloader.bootloader.file=empty/empty.hex
megaAVR0_noloader.bootloader.programed_type=
megaAVR0_noloader.build.console_select=
megaAVR0_noloader.build.export_merged_output=false
megaAVR0_noloader.build.text_section_start=.text=0x0
megaAVR0_noloader.build.buildopt=-DNDEBUG
megaAVR0_noloader.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0_noloader.build.macroapi=-DENABLE_MACRO_API
megaAVR0_noloader.build.printf=
megaAVR0_noloader.build.printflt=
megaAVR0_noloader.build.linker_script=avrxmega3_p128.x
megaAVR0_noloader.upload.tool=

