askn37/multix-zinnia-sdk-megaAVR/boards.txt
megaAVR0_noloader.menu.01_variant.ATmega4809_48P.build.board=AVR_ATMEGA4809
megaAVR0_noloader.menu.01_variant.ATmega4809_48P.build.mcu=atmega4809
megaAVR0_noloader.menu.01_variant.ATmega4809_48P.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.ATmega4809_48P.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.ATmega4809_48P.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.ATmega4809_48P=48pin ATmega4809 (48KiB+6KiB)

megaAVR0_noloader.menu.01_variant.ATmega3209_48P.build.board=AVR_ATMEGA3209
megaAVR0_noloader.menu.01_variant.ATmega3209_48P.build.mcu=atmega3209
megaAVR0_noloader.menu.01_variant.ATmega3209_48P.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.ATmega3209_48P.upload.maximum_data_size=4096
megaAVR0_noloader.menu.01_variant.ATmega3209_48P.upload.maximum_size=32768
megaAVR0_noloader.menu.01_variant.ATmega3209_48P=48pin ATmega3209 (32KiB+4KiB)

megaAVR0_noloader.menu.01_variant.ATmega1609_48P.build.board=AVR_ATMEGA1609
megaAVR0_noloader.menu.01_variant.ATmega1609_48P.build.mcu=atmega1609
megaAVR0_noloader.menu.01_variant.ATmega1609_48P.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.ATmega1609_48P.upload.maximum_data_size=2048
megaAVR0_noloader.menu.01_variant.ATmega1609_48P.upload.maximum_size=16384
megaAVR0_noloader.menu.01_variant.ATmega1609_48P=48pin ATmega1609 (16KiB+2KiB)

megaAVR0_noloader.menu.01_variant.ATmega809_48P.build.board=AVR_ATMEGA809
megaAVR0_noloader.menu.01_variant.ATmega809_48P.build.mcu=atmega809
megaAVR0_noloader.menu.01_variant.ATmega809_48P.build.variant=megaAVR0_48
megaAVR0_noloader.menu.01_variant.ATmega809_48P.upload.maximum_data_size=1024
megaAVR0_noloader.menu.01_variant.ATmega809_48P.upload.maximum_size=8192
megaAVR0_noloader.menu.01_variant.ATmega809_48P=48pin ATmega809 (8KiB+1KiB)

megaAVR0_noloader.menu.01_variant.separator1=-

megaAVR0_noloader.menu.01_variant.ATmega4809_40P.build.board=AVR_ATMEGA4809
megaAVR0_noloader.menu.01_variant.ATmega4809_40P.build.mcu=atmega4809
megaAVR0_noloader.menu.01_variant.ATmega4809_40P.build.variant=megaAVR0_40
megaAVR0_noloader.menu.01_variant.ATmega4809_40P.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.ATmega4809_40P.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.ATmega4809_40P=40pin ATmega4809 (48KiB+6KiB)

megaAVR0_noloader.menu.01_variant.separator2=-

megaAVR0_noloader.menu.01_variant.ATmega4808_32P.build.board=AVR_ATMEGA4808
megaAVR0_noloader.menu.01_variant.ATmega4808_32P.build.mcu=atmega4808
megaAVR0_noloader.menu.01_variant.ATmega4808_32P.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.ATmega4808_32P.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.ATmega4808_32P.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.ATmega4808_32P=32pin ATmega4808 (48KiB+6KiB)

megaAVR0_noloader.menu.01_variant.ATmega3208_32P.build.board=AVR_ATMEGA3208
megaAVR0_noloader.menu.01_variant.ATmega3208_32P.build.mcu=atmega3208
megaAVR0_noloader.menu.01_variant.ATmega3208_32P.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.ATmega3208_32P.upload.maximum_data_size=4096
megaAVR0_noloader.menu.01_variant.ATmega3208_32P.upload.maximum_size=32768
megaAVR0_noloader.menu.01_variant.ATmega3208_32P=32pin ATmega3208 (32KiB+4KiB)

megaAVR0_noloader.menu.01_variant.ATmega1608_32P.build.board=AVR_ATMEGA1608
megaAVR0_noloader.menu.01_variant.ATmega1608_32P.build.mcu=atmega1608
megaAVR0_noloader.menu.01_variant.ATmega1608_32P.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.ATmega1608_32P.upload.maximum_data_size=2048
megaAVR0_noloader.menu.01_variant.ATmega1608_32P.upload.maximum_size=16384
megaAVR0_noloader.menu.01_variant.ATmega1608_32P=32pin ATmega1608 (16KiB+2KiB)

megaAVR0_noloader.menu.01_variant.ATmega808_32P.build.board=AVR_ATMEGA808
megaAVR0_noloader.menu.01_variant.ATmega808_32P.build.mcu=atmega808
megaAVR0_noloader.menu.01_variant.ATmega808_32P.build.variant=megaAVR0_32
megaAVR0_noloader.menu.01_variant.ATmega808_32P.upload.maximum_data_size=1024
megaAVR0_noloader.menu.01_variant.ATmega808_32P.upload.maximum_size=8192
megaAVR0_noloader.menu.01_variant.ATmega808_32P=32pin ATmega808 (8KiB+1KiB)

megaAVR0_noloader.menu.01_variant.separator3=-

megaAVR0_noloader.menu.01_variant.ATmega4808_28P.build.board=AVR_ATMEGA4808
megaAVR0_noloader.menu.01_variant.ATmega4808_28P.build.mcu=atmega4808
megaAVR0_noloader.menu.01_variant.ATmega4808_28P.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.ATmega4808_28P.upload.maximum_data_size=6144
megaAVR0_noloader.menu.01_variant.ATmega4808_28P.upload.maximum_size=49152
megaAVR0_noloader.menu.01_variant.ATmega4808_28P=28pin ATmega4808 (48KiB+6KiB)

megaAVR0_noloader.menu.01_variant.ATmega3208_28P.build.board=AVR_ATMEGA3208
megaAVR0_noloader.menu.01_variant.ATmega3208_28P.build.mcu=atmega3208
megaAVR0_noloader.menu.01_variant.ATmega3208_28P.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.ATmega3208_28P.upload.maximum_data_size=4096
megaAVR0_noloader.menu.01_variant.ATmega3208_28P.upload.maximum_size=32768
megaAVR0_noloader.menu.01_variant.ATmega3208_28P=28pin ATmega3208 (32KiB+4KiB)

megaAVR0_noloader.menu.01_variant.ATmega1608_28P.build.board=AVR_ATMEGA1608
megaAVR0_noloader.menu.01_variant.ATmega1608_28P.build.mcu=atmega1608
megaAVR0_noloader.menu.01_variant.ATmega1608_28P.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.ATmega1608_28P.upload.maximum_data_size=2048
megaAVR0_noloader.menu.01_variant.ATmega1608_28P.upload.maximum_size=16384
megaAVR0_noloader.menu.01_variant.ATmega1608_28P=28pin ATmega1608 (16KiB+2KiB)

megaAVR0_noloader.menu.01_variant.ATmega808_28P.build.board=AVR_ATMEGA808
megaAVR0_noloader.menu.01_variant.ATmega808_28P.build.mcu=atmega808
megaAVR0_noloader.menu.01_variant.ATmega808_28P.build.variant=megaAVR0_28
megaAVR0_noloader.menu.01_variant.ATmega808_28P.upload.maximum_data_size=1024
megaAVR0_noloader.menu.01_variant.ATmega808_28P.upload.maximum_size=8192
megaAVR0_noloader.menu.01_variant.ATmega808_28P=28pin ATmega808 (8KiB+1KiB)

megaAVR0_noloader.menu.02_clock.20MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.20MHz.build.f_cpu=20000000L
megaAVR0_noloader.menu.02_clock.20MHz=Internal 20 MHz
megaAVR0_noloader.menu.02_clock.10MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.10MHz.build.f_cpu=10000000L
megaAVR0_noloader.menu.02_clock.10MHz=Internal 10 MHz
megaAVR0_noloader.menu.02_clock.5MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.5MHz.build.f_cpu=5000000L
megaAVR0_noloader.menu.02_clock.5MHz=Internal 5 MHz

megaAVR0_noloader.menu.02_clock.separator1=-

megaAVR0_noloader.menu.02_clock.16MHz.bootloader.OSCCFG=0x7D
megaAVR0_noloader.menu.02_clock.16MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.16MHz.build.f_cpu=16000000L
megaAVR0_noloader.menu.02_clock.16MHz=Internal 16 MHz

megaAVR0_noloader.menu.02_clock.8MHz.bootloader.OSCCFG=0x7D
megaAVR0_noloader.menu.02_clock.8MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.8MHz.build.f_cpu=8000000L
megaAVR0_noloader.menu.02_clock.8MHz=Internal 8 MHz

megaAVR0_noloader.menu.02_clock.4MHz.bootloader.OSCCFG=0x7D
megaAVR0_noloader.menu.02_clock.4MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.4MHz.build.f_cpu=4000000L
megaAVR0_noloader.menu.02_clock.4MHz=Internal 4 MHz

megaAVR0_noloader.menu.02_clock.1MHz.bootloader.OSCCFG=0x7D
megaAVR0_noloader.menu.02_clock.1MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.1MHz.build.f_cpu=1000000L
megaAVR0_noloader.menu.02_clock.1MHz=Internal 1 MHz

megaAVR0_noloader.menu.02_clock.separator2=-

