askn37/multix-zinnia-sdk-megaAVR/boards.txt
megaAVR0_noloader.menu.02_clock.2MHz.bootloader.bod_sample=0
megaAVR0_noloader.menu.02_clock.2MHz.build.f_cpu=2000000L
megaAVR0_noloader.menu.02_clock.2MHz=Internal 2 MHz

megaAVR0_noloader.menu.02_clock.32768Hz.bootloader.bod_sample=1
megaAVR0_noloader.menu.02_clock.32768Hz.build.f_cpu=32768L
megaAVR0_noloader.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# megaAVR0_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# megaAVR0_noloader.menu.11_BODMODE.Disabled=BOD Disabled
# megaAVR0_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# megaAVR0_noloader.menu.11_BODMODE.Enabled=BOD Enabled
# megaAVR0_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# megaAVR0_noloader.menu.11_BODMODE.Sampled=BOD Sampled
# megaAVR0_noloader.menu.11_BODMODE.Enablewait.bootloader.bod_mode=11
# megaAVR0_noloader.menu.11_BODMODE.Enablewait=BOD Enabled hold wakeup

# megaAVR0_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# megaAVR0_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
# megaAVR0_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# megaAVR0_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.6V
# megaAVR0_noloader.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
# megaAVR0_noloader.menu.12_BODLVL.BODLEVEL7=Level 4.3V

megaAVR0_noloader.menu.21_resetpin.Reset.bootloader.reset_bit=11
megaAVR0_noloader.menu.21_resetpin.Reset=Reset

megaAVR0_noloader.menu.21_resetpin.Gpio.bootloader.reset_bit=01
megaAVR0_noloader.menu.21_resetpin.Gpio=GPIO (input only)

megaAVR0_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
megaAVR0_noloader.menu.24_eeprom.Retained=Save guard "Retained"

megaAVR0_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
megaAVR0_noloader.menu.24_eeprom.Erase=Save guard "Erase"

megaAVR0_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
megaAVR0_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
megaAVR0_noloader.menu.24_eeprom.Upload=Upload ".eep" file

megaAVR0_noloader.menu.26_userrow.Keep=Save guard "Retained"

megaAVR0_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
megaAVR0_noloader.menu.26_userrow.Upload=Upload ".urow" file

megaAVR0_noloader.menu.27_fusefile.Menu=Specify in the MENU

megaAVR0_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
megaAVR0_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

megaAVR0_noloader.menu.51_buildopt.Release=Release (default)

megaAVR0_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
megaAVR0_noloader.menu.51_buildopt.Debug1=DEBUG=1

megaAVR0_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
megaAVR0_noloader.menu.51_buildopt.Debug2=DEBUG=2

megaAVR0_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

megaAVR0_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
megaAVR0_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
megaAVR0_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

megaAVR0_noloader.menu.52_macroapi.Disable.build.macroapi=
megaAVR0_noloader.menu.52_macroapi.Disable=Macro API Disable

megaAVR0_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
megaAVR0_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
megaAVR0_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

megaAVR0_noloader.menu.53_printf.Default=Integer Only

megaAVR0_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
megaAVR0_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
megaAVR0_noloader.menu.53_printf.Full=Float Support

megaAVR0_noloader.menu.54_console_select.UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7

megaAVR0_noloader.menu.54_console_select.separator1=-

megaAVR0_noloader.menu.54_console_select.UART1_C0_LA7.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.UART1_C0_LA7=UART1 TX:PC0 RX:PC1 LED=PA7

megaAVR0_noloader.menu.54_console_select.UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7

megaAVR0_noloader.menu.54_console_select.UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
megaAVR0_noloader.menu.54_console_select.UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48pin)

megaAVR0_noloader.menu.54_console_select.separator2=-

megaAVR0_noloader.menu.54_console_select.UART3_B4_LD6.build.console_select=-DSerial=Serial3B -DLED_BUILTIN=PIN_PD6
megaAVR0_noloader.menu.54_console_select.UART3_B4_LD6=UART3 TX:PB4 RX:PB5 LED=PD6 (ATmega4809 UNO WiFi)

megaAVR0_noloader.menu.54_console_select.UART3_B4_LE2_NanoEvery.build.console_select=-DSerial=Serial3B -DLED_BUILTIN=PIN_PE2
megaAVR0_noloader.menu.54_console_select.UART3_B4_LE2_NanoEvery.upload.tool=avrdude
megaAVR0_noloader.menu.54_console_select.UART3_B4_LE2_NanoEvery.upload.protocol=jtag2updi -e
megaAVR0_noloader.menu.54_console_select.UART3_B4_LE2_NanoEvery.upload.speed=115200
megaAVR0_noloader.menu.54_console_select.UART3_B4_LE2_NanoEvery.upload.use_1200bps_touch=true
megaAVR0_noloader.menu.54_console_select.UART3_B4_LE2_NanoEvery=UART3 TX:PB4 RX:PB5 LED=PE2 (ATmega4809 Nano Every)

megaAVR0_noloader.menu.54_console_select.UART1_C9_LC7_SB2_XplainedPro.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PC7 -DSW_BUILTIN=PIN_PB2
megaAVR0_noloader.menu.54_console_select.UART1_C9_LC7_SB2_XplainedPro=UART1 TX:PC0 RX:PC1 LED=PC7 SW=PB2 (ATmega4809 Xplained PRO)

megaAVR0_noloader.menu.54_console_select.UART3_B0_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
megaAVR0_noloader.menu.54_console_select.UART3_B0_LF5_SF6_Curiosity=UART3 TX:PB0 RX:PB1 LED=PF5 SW=PF6 (ATmega4809 Curiosity Nano)

megaAVR0_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
megaAVR0_noloader.menu.90_console_baud.9600bps=9600 bps (default)

megaAVR0_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
megaAVR0_noloader.menu.90_console_baud.38400bps=38400 bps

