askn37/multix-zinnia-sdk-megaAVR/boards.txt
megaAVR0_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
megaAVR0_noloader.menu.90_console_baud.57600bps=57600 bps

megaAVR0_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
megaAVR0_noloader.menu.90_console_baud.115200bps=115200 bps

megaAVR0_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
megaAVR0_noloader.menu.90_console_baud.230400bps=230400 bps

megaAVR0_noloader.menu.90_console_baud.250000bps.build.console_baud=-DCONSOLE_BAUD=250000
megaAVR0_noloader.menu.90_console_baud.250000bps=250000 bps

megaAVR0_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
megaAVR0_noloader.menu.90_console_baud.500000bps=500000 bps

megaAVR0_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
megaAVR0_noloader.menu.90_console_baud.1000000bps=1000000 bps

megaAVR0_noloader.menu.90_console_baud.separator1=-

megaAVR0_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400
megaAVR0_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)


tinyAVR012_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR012_noloader.bootloader.BOOTSIZE=0x00
tinyAVR012_noloader.bootloader.CODESIZE=0x00
tinyAVR012_noloader.bootloader.OSCCFG=0x7E
tinyAVR012_noloader.bootloader.SYSCFG0=0b01101{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR012_noloader.bootloader.SYSCFG1=0xFF
tinyAVR012_noloader.bootloader.WDTCFG=0x00
tinyAVR012_noloader.bootloader.bod_lvl=000
tinyAVR012_noloader.bootloader.bod_mode=00
tinyAVR012_noloader.bootloader.bod_sample=0
tinyAVR012_noloader.bootloader.eepupload=
tinyAVR012_noloader.bootloader.urowupload=
tinyAVR012_noloader.bootloader.fuseupload={bootloader.fuses}
tinyAVR012_noloader.bootloader.eesave_bit=1
tinyAVR012_noloader.bootloader.reset_bit=01
tinyAVR012_noloader.bootloader.tool=avrdude
tinyAVR012_noloader.bootloader.file=empty/empty.hex
tinyAVR012_noloader.bootloader.programed_type=
tinyAVR012_noloader.build.console_select=
tinyAVR012_noloader.build.export_merged_output=false
tinyAVR012_noloader.build.text_section_start=.text=0x0
tinyAVR012_noloader.build.buildopt=-DNDEBUG
tinyAVR012_noloader.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012_noloader.build.macroapi=-DENABLE_MACRO_API
tinyAVR012_noloader.build.printf=
tinyAVR012_noloader.build.printflt=
tinyAVR012_noloader.build.linker_script=avrxmega3_p64.x
tinyAVR012_noloader.upload.tool=

tinyAVR012_noloader.menu.01_variant.ATtiny3227.build.board=AVR_ATTINY3227
tinyAVR012_noloader.menu.01_variant.ATtiny3227.build.mcu=attiny3227
tinyAVR012_noloader.menu.01_variant.ATtiny3227.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.ATtiny3227.build.linker_script=avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.ATtiny3227.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.ATtiny3227.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.ATtiny3227=tinyAVR-2 24pin ATtiny3227 (32KiB+3KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny1627.build.board=AVR_ATTINY1627
tinyAVR012_noloader.menu.01_variant.ATtiny1627.build.mcu=attiny1627
tinyAVR012_noloader.menu.01_variant.ATtiny1627.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.ATtiny1627.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.ATtiny1627.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.ATtiny1627=tinyAVR-2 24pin ATtiny1627 (16KiB+2KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny827.build.board=AVR_ATTINY827
tinyAVR012_noloader.menu.01_variant.ATtiny827.build.mcu=attiny827
tinyAVR012_noloader.menu.01_variant.ATtiny827.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.ATtiny827.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.ATtiny827.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.ATtiny827=tinyAVR-2 24pin ATtiny827 (8KiB+1KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny427.build.board=AVR_ATTINY427
tinyAVR012_noloader.menu.01_variant.ATtiny427.build.mcu=attiny427
tinyAVR012_noloader.menu.01_variant.ATtiny427.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.ATtiny427.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.ATtiny427.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny427=tinyAVR-2 24pin ATtiny427 (4KiB+512B)

tinyAVR012_noloader.menu.01_variant.separator1=-

tinyAVR012_noloader.menu.01_variant.ATtiny3226.build.board=AVR_ATTINY3226
tinyAVR012_noloader.menu.01_variant.ATtiny3226.build.mcu=attiny3226
tinyAVR012_noloader.menu.01_variant.ATtiny3226.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.ATtiny3226.build.linker_script=avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.ATtiny3226.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.ATtiny3226.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.ATtiny3226=tinyAVR-2 20pin ATtiny3226 (32KiB+3KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny1626.build.board=AVR_ATTINY1626
tinyAVR012_noloader.menu.01_variant.ATtiny1626.build.mcu=attiny1626
tinyAVR012_noloader.menu.01_variant.ATtiny1626.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.ATtiny1626.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.ATtiny1626.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.ATtiny1626=tinyAVR-2 20pin ATtiny1626 (16KiB+2KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny826.build.board=AVR_ATTINY826
tinyAVR012_noloader.menu.01_variant.ATtiny826.build.mcu=attiny826
tinyAVR012_noloader.menu.01_variant.ATtiny826.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.ATtiny826.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.ATtiny826.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.ATtiny826=tinyAVR-2 20pin ATtiny826 (8KiB+1KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny426.build.board=AVR_ATTINY426
tinyAVR012_noloader.menu.01_variant.ATtiny426.build.mcu=attiny426
tinyAVR012_noloader.menu.01_variant.ATtiny426.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.ATtiny426.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.ATtiny426.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny426=tinyAVR-2 20pin ATtiny426 (4KiB+512B)

tinyAVR012_noloader.menu.01_variant.separator2=-

tinyAVR012_noloader.menu.01_variant.ATtiny3224.build.board=AVR_ATTINY3224
tinyAVR012_noloader.menu.01_variant.ATtiny3224.build.mcu=attiny3224
tinyAVR012_noloader.menu.01_variant.ATtiny3224.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.ATtiny3224.build.linker_script=avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.ATtiny3224.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.ATtiny3224.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.ATtiny3224=tinyAVR-2 14pin ATtiny3224 (32KiB+3KiB)

