askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012_noloader.menu.01_variant.ATtiny414.build.board=AVR_ATTINY414
tinyAVR012_noloader.menu.01_variant.ATtiny414.build.mcu=attiny414
tinyAVR012_noloader.menu.01_variant.ATtiny414.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.ATtiny414.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.ATtiny414.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny414=tinyAVR-1 14pin ATtiny414 (4KiB+256B)

tinyAVR012_noloader.menu.01_variant.separator6=-

tinyAVR012_noloader.menu.01_variant.ATtiny412.build.board=AVR_ATTINY412
tinyAVR012_noloader.menu.01_variant.ATtiny412.build.mcu=attiny412
tinyAVR012_noloader.menu.01_variant.ATtiny412.build.variant=tinyAVR1_8
tinyAVR012_noloader.menu.01_variant.ATtiny412.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.ATtiny412.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny412=tinyAVR-1 8pin ATtiny412 (4KiB+256B)

tinyAVR012_noloader.menu.01_variant.ATtiny212.build.board=AVR_ATTINY212
tinyAVR012_noloader.menu.01_variant.ATtiny212.build.mcu=attiny212
tinyAVR012_noloader.menu.01_variant.ATtiny212.build.variant=tinyAVR1_8
tinyAVR012_noloader.menu.01_variant.ATtiny212.upload.maximum_data_size=128
tinyAVR012_noloader.menu.01_variant.ATtiny212.upload.maximum_size=2048
tinyAVR012_noloader.menu.01_variant.ATtiny212=tinyAVR-1 8pin ATtiny212 (2KiB+128B)

tinyAVR012_noloader.menu.01_variant.separator7=-

tinyAVR012_noloader.menu.01_variant.ATtiny1607.build.board=AVR_ATTINY1607
tinyAVR012_noloader.menu.01_variant.ATtiny1607.build.mcu=attiny1607
tinyAVR012_noloader.menu.01_variant.ATtiny1607.build.variant=tinyAVR0_24
tinyAVR012_noloader.menu.01_variant.ATtiny1607.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.ATtiny1607.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.ATtiny1607=tinyAVR-0 24pin ATtiny1607 (16KiB+1KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny807.build.board=AVR_ATTINY807
tinyAVR012_noloader.menu.01_variant.ATtiny807.build.mcu=attiny807
tinyAVR012_noloader.menu.01_variant.ATtiny807.build.variant=tinyAVR0_24
tinyAVR012_noloader.menu.01_variant.ATtiny807.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.ATtiny807.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.ATtiny807=tinyAVR-0 24pin ATtiny807 (8KiB+512B)

tinyAVR012_noloader.menu.01_variant.separator8=-

tinyAVR012_noloader.menu.01_variant.ATtiny1606.build.board=AVR_ATTINY1606
tinyAVR012_noloader.menu.01_variant.ATtiny1606.build.mcu=attiny1606
tinyAVR012_noloader.menu.01_variant.ATtiny1606.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.ATtiny1606.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.ATtiny1606.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.ATtiny1606=tinyAVR-0 20pin ATtiny1606 (16KiB+1KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny806.build.board=AVR_ATTINY806
tinyAVR012_noloader.menu.01_variant.ATtiny806.build.mcu=attiny806
tinyAVR012_noloader.menu.01_variant.ATtiny806.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.ATtiny806.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.ATtiny806.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.ATtiny806=tinyAVR-0 20pin ATtiny806 (8KiB+512B)

tinyAVR012_noloader.menu.01_variant.ATtiny406.build.board=AVR_ATTINY406
tinyAVR012_noloader.menu.01_variant.ATtiny406.build.mcu=attiny406
tinyAVR012_noloader.menu.01_variant.ATtiny406.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.ATtiny406.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.ATtiny406.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny406=tinyAVR-0 20pin ATtiny406 (4KiB+256B)

tinyAVR012_noloader.menu.01_variant.separator9=-

tinyAVR012_noloader.menu.01_variant.ATtiny1604.build.board=AVR_ATTINY1604
tinyAVR012_noloader.menu.01_variant.ATtiny1604.build.mcu=attiny1604
tinyAVR012_noloader.menu.01_variant.ATtiny1604.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.ATtiny1604.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.ATtiny1604.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.ATtiny1604=tinyAVR-0 14pin ATtiny1604 (16KiB+1KiB)

tinyAVR012_noloader.menu.01_variant.ATtiny804.build.board=AVR_ATTINY804
tinyAVR012_noloader.menu.01_variant.ATtiny804.build.mcu=attiny804
tinyAVR012_noloader.menu.01_variant.ATtiny804.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.ATtiny804.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.ATtiny804.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.ATtiny804=tinyAVR-0 14pin ATtiny804 (8KiB+512B)

tinyAVR012_noloader.menu.01_variant.ATtiny404.build.board=AVR_ATTINY404
tinyAVR012_noloader.menu.01_variant.ATtiny404.build.mcu=attiny404
tinyAVR012_noloader.menu.01_variant.ATtiny404.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.ATtiny404.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.ATtiny404.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny404=tinyAVR-0 14pin ATtiny404 (4KiB+256B)

tinyAVR012_noloader.menu.01_variant.separatorA=-

tinyAVR012_noloader.menu.01_variant.ATtiny402.build.board=AVR_ATTINY402
tinyAVR012_noloader.menu.01_variant.ATtiny402.build.mcu=attiny402
tinyAVR012_noloader.menu.01_variant.ATtiny402.build.variant=tinyAVR0_8
tinyAVR012_noloader.menu.01_variant.ATtiny402.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.ATtiny402.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.ATtiny402=tinyAVR-0 8pin ATtiny402 (4KiB+256B)

tinyAVR012_noloader.menu.01_variant.ATtiny202.build.board=AVR_ATTINY202
tinyAVR012_noloader.menu.01_variant.ATtiny202.build.mcu=attiny202
tinyAVR012_noloader.menu.01_variant.ATtiny202.build.variant=tinyAVR0_8
tinyAVR012_noloader.menu.01_variant.ATtiny202.upload.maximum_data_size=128
tinyAVR012_noloader.menu.01_variant.ATtiny202.upload.maximum_size=1536
tinyAVR012_noloader.menu.01_variant.ATtiny202=tinyAVR-0 8pin ATtiny202 (2KiB+128B)

tinyAVR012_noloader.menu.02_clock.20MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.20MHz.build.f_cpu=20000000L
tinyAVR012_noloader.menu.02_clock.20MHz=Internal 20 MHz

tinyAVR012_noloader.menu.02_clock.10MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.10MHz.build.f_cpu=10000000L
tinyAVR012_noloader.menu.02_clock.10MHz=Internal 10 MHz

