askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012_noloader.menu.02_clock.5MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.5MHz.build.f_cpu=5000000L
tinyAVR012_noloader.menu.02_clock.5MHz=Internal 5 MHz

tinyAVR012_noloader.menu.02_clock.separator1=-

tinyAVR012_noloader.menu.02_clock.16MHz.bootloader.OSCCFG=0x7D
tinyAVR012_noloader.menu.02_clock.16MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.16MHz.build.f_cpu=16000000L
tinyAVR012_noloader.menu.02_clock.16MHz=Internal 16 MHz

tinyAVR012_noloader.menu.02_clock.8MHz.bootloader.OSCCFG=0x7D
tinyAVR012_noloader.menu.02_clock.8MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.8MHz.build.f_cpu=8000000L
tinyAVR012_noloader.menu.02_clock.8MHz=Internal 8 MHz

tinyAVR012_noloader.menu.02_clock.4MHz.bootloader.OSCCFG=0x7D
tinyAVR012_noloader.menu.02_clock.4MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.4MHz.build.f_cpu=4000000L
tinyAVR012_noloader.menu.02_clock.4MHz=Internal 4 MHz

tinyAVR012_noloader.menu.02_clock.1MHz.bootloader.OSCCFG=0x7D
tinyAVR012_noloader.menu.02_clock.1MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.1MHz.build.f_cpu=1000000L
tinyAVR012_noloader.menu.02_clock.1MHz=Internal 1 MHz

tinyAVR012_noloader.menu.02_clock.separator2=-

tinyAVR012_noloader.menu.02_clock.2MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.2MHz.build.f_cpu=2000000L
tinyAVR012_noloader.menu.02_clock.2MHz=Internal 2 MHz

tinyAVR012_noloader.menu.02_clock.32768Hz.bootloader.bod_sample=1
tinyAVR012_noloader.menu.02_clock.32768Hz.build.f_cpu=32768L
tinyAVR012_noloader.menu.02_clock.32768Hz=Internal 32.768 kHz (ULP)

# tinyAVR012_noloader.menu.11_BODMODE.Disabled.bootloader.bod_mode=00
# tinyAVR012_noloader.menu.11_BODMODE.Disabled=BOD Disabled
# tinyAVR012_noloader.menu.11_BODMODE.Enabled.bootloader.bod_mode=01
# tinyAVR012_noloader.menu.11_BODMODE.Enabled=BOD Enabled
# tinyAVR012_noloader.menu.11_BODMODE.Sampled.bootloader.bod_mode=10
# tinyAVR012_noloader.menu.11_BODMODE.Sampled=BOD Sampled
# tinyAVR012_noloader.menu.11_BODMODE.EnableWait.bootloader.bod_mode=11
# tinyAVR012_noloader.menu.11_BODMODE.EnableWait=BOD Enabled hold wakeup

# tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
# tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.6V
# tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
# tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL7=Level 4.3V

# tinyAVR012_noloader.menu.22_updipin.Updi.bootloader.reset_bit=01
# tinyAVR012_noloader.menu.22_updipin.Updi=PA0 pin=UPDI (default)
# tinyAVR012_noloader.menu.22_updipin.ResetAlt.bootloader.reset_bit=11
# tinyAVR012_noloader.menu.22_updipin.ResetAlt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
# tinyAVR012_noloader.menu.22_updipin.separator1=-
# tinyAVR012_noloader.menu.22_updipin.Reset.bootloader.reset_bit=10
# tinyAVR012_noloader.menu.22_updipin.Reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
# tinyAVR012_noloader.menu.22_updipin.Gpio.bootloader.reset_bit=00
# tinyAVR012_noloader.menu.22_updipin.Gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)

tinyAVR012_noloader.menu.24_eeprom.Retained.bootloader.eesave_bit=1
tinyAVR012_noloader.menu.24_eeprom.Retained=Save guard "Retained"

tinyAVR012_noloader.menu.24_eeprom.Erase.bootloader.eesave_bit=0
tinyAVR012_noloader.menu.24_eeprom.Erase=Save guard "Erase"

tinyAVR012_noloader.menu.24_eeprom.Upload.bootloader.eepupload={bootloader.eeprom}
tinyAVR012_noloader.menu.24_eeprom.Upload.bootloader.eesave_bit=1
tinyAVR012_noloader.menu.24_eeprom.Upload=Upload ".eep" file

tinyAVR012_noloader.menu.26_userrow.Keep=Save guard "Retained"
tinyAVR012_noloader.menu.26_userrow.Upload.bootloader.urowupload={bootloader.userrow}
tinyAVR012_noloader.menu.26_userrow.Upload=Upload ".urow" file

tinyAVR012_noloader.menu.27_fusefile.Menu=Specify in the MENU
tinyAVR012_noloader.menu.27_fusefile.Upload.bootloader.fuseupload={bootloader.fusefile}
tinyAVR012_noloader.menu.27_fusefile.Upload=Upload ".fuse" file (Use with caution)

tinyAVR012_noloader.menu.51_buildopt.Release=Release (default)

tinyAVR012_noloader.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
tinyAVR012_noloader.menu.51_buildopt.Debug1=DEBUG=1

tinyAVR012_noloader.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2
tinyAVR012_noloader.menu.51_buildopt.Debug2=DEBUG=2

tinyAVR012_noloader.menu.52_macroapi.Enable=Macro API Enable (default)

tinyAVR012_noloader.menu.52_macroapi.WoStartup.build.macroapi=-DENABLE_MACRO_API -DWOSFILES=1
tinyAVR012_noloader.menu.52_macroapi.WoStartup.compiler.ldflags=-nostartfiles
tinyAVR012_noloader.menu.52_macroapi.WoStartup=Macro API Enable without startup

tinyAVR012_noloader.menu.52_macroapi.Disable.build.macroapi=
tinyAVR012_noloader.menu.52_macroapi.Disable=Macro API Disable

tinyAVR012_noloader.menu.52_macroapi.AllDisable.build.macroapi=-DWOSFILES=1 -DWOSTDLIB=1
tinyAVR012_noloader.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib
tinyAVR012_noloader.menu.52_macroapi.AllDisable=Standard Library All Disable

tinyAVR012_noloader.menu.53_printf.Default=Integer Only

tinyAVR012_noloader.menu.53_printf.Full=Float Support
tinyAVR012_noloader.menu.53_printf.Full.build.printf=-DUSE_PRINTF_FLT
tinyAVR012_noloader.menu.53_printf.Full.build.printflt=-Wl,-u,vfprintf -lprintf_flt

tinyAVR012_noloader.menu.54_console_select.UART0_B2_LA7=UART0 TX:PB2 RX:PB3 LED=PA7
tinyAVR012_noloader.menu.54_console_select.UART0_B2_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7

tinyAVR012_noloader.menu.54_console_select.UART0_A1_LA7=UART0 TX:PA1 RX:PA2 LED=PA7 (alternative)
tinyAVR012_noloader.menu.54_console_select.UART0_A1_LA7.build.console_select=-DSerial=Serial0B -DLED_BUILTIN=PIN_PA7

tinyAVR012_noloader.menu.54_console_select.UART1_A1_LA7=UART1 TX:PA1 RX:PA2 LED=PA7 (tinyAVR-2)
tinyAVR012_noloader.menu.54_console_select.UART1_A1_LA7.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PA7

tinyAVR012_noloader.menu.54_console_select.UART1_C2_LA7=UART1 TX:PC2 RX:PC1 LED=PA7 (tinyAVR-2 Alt)
tinyAVR012_noloader.menu.54_console_select.UART1_C2_LA7.build.console_select=-DSerial=Serial1B -DLED_BUILTIN=PIN_PA7

tinyAVR012_noloader.menu.54_console_select.separator1=-

