askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012_noloader.menu.54_console_select.UART0_A6_LA3=UART0 TX:PA6 RX:PA7 LED=PA3 (8pin)
tinyAVR012_noloader.menu.54_console_select.UART0_A6_LA3.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA3

tinyAVR012_noloader.menu.54_console_select.UART0_A1_LA3=UART0 TX:PA1 RX:PA2 LED=PA3 (8pin)
tinyAVR012_noloader.menu.54_console_select.UART0_A1_LA3.build.console_select=-DSerial=Serial0B -DLED_BUILTIN=PIN_PA3

tinyAVR012_noloader.menu.54_console_select.separator2=-

tinyAVR012_noloader.menu.54_console_select.UART0_A1_LB5_SB4_XplainedNano=UART0 TX:PA1 RX:PA2 LED=PB5 SW=PB4 (ATtiny416 Xplained Nano)
tinyAVR012_noloader.menu.54_console_select.UART0_A1_LB5_SB4_XplainedNano.build.console_select=-DSerial=Serial0B -DLED_BUILTIN=PIN_PB5 -DSW_BUILTIN=PIN_PB4

tinyAVR012_noloader.menu.54_console_select.UART0_B2_LC0_SC5_XplainedMini=UART0 TX:PB2 RX:PB3 LED=PC0 SW=PC5 (ATtiny817 Xplained Mini)
tinyAVR012_noloader.menu.54_console_select.UART0_B2_LC0_SC5_XplainedMini.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PC0 -DSW_BUILTIN=PIN_PC5

tinyAVR012_noloader.menu.54_console_select.UART0_B2_LC7_SB5_XplainedPro=UART0 TX:PB2 RX:PB3 LED=PC7 SW=PB5 (ATtiny817/3217 Xplained Pro)
tinyAVR012_noloader.menu.54_console_select.UART0_B2_LC7_SB5_XplainedPro.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PC7 -DSW_BUILTIN=PIN_PB5

tinyAVR012_noloader.menu.54_console_select.UART0_B2_LB2_SC4_Curiosity=UART0 TX:PB2 RX:PB3 LED=PB7 SW=PC4 (ATtiny1607/1627 Curiosity Nano)
tinyAVR012_noloader.menu.54_console_select.UART0_B2_LB2_SC4_Curiosity.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PB7 -DSW_BUILTIN=PIN_PC4

tinyAVR012_noloader.menu.54_console_select.UART0_B2_LA3_SB7_Curiosity=UART0 TX:PB2 RX:PA3 LED=PA3 SW=PB7 (ATtiny3217 Curiosity Nano)
tinyAVR012_noloader.menu.54_console_select.UART0_B2_LA3_SB7_Curiosity.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA3 -DSW_BUILTIN=PIN_PB7

tinyAVR012_noloader.menu.90_console_baud.9600bps=9600 bps (default)
tinyAVR012_noloader.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600

tinyAVR012_noloader.menu.90_console_baud.38400bps=38400 bps
tinyAVR012_noloader.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400

tinyAVR012_noloader.menu.90_console_baud.57600bps=57600 bps
tinyAVR012_noloader.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600

tinyAVR012_noloader.menu.90_console_baud.115200bps=115200 bps
tinyAVR012_noloader.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200

tinyAVR012_noloader.menu.90_console_baud.230400bps=230400 bps
tinyAVR012_noloader.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400

tinyAVR012_noloader.menu.90_console_baud.250000bps=250000 bps
tinyAVR012_noloader.menu.90_console_baud.250000bps.build.console_baud=-DCONSOLE_BAUD=250000

tinyAVR012_noloader.menu.90_console_baud.500000bps=500000 bps
tinyAVR012_noloader.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000

tinyAVR012_noloader.menu.90_console_baud.1000000bps=1000000 bps
tinyAVR012_noloader.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000

tinyAVR012_noloader.menu.90_console_baud.separator1=-

tinyAVR012_noloader.menu.90_console_baud.2400bps=2400 bps (for ULP)
tinyAVR012_noloader.menu.90_console_baud.2400bps.build.console_baud=-DCONSOLE_BAUD=2400


